RU_TEXTS = {
    "language_changed": "✅ Язык успешно изменён",
    "choose_action": "Выберите один из разделов:",

    # ============ MAIN MENU BUTTONS ============
    "menu_test": "🧠 Пройти тест",
    "menu_appointment": "📅 Записаться к психологу",
    "menu_lessons": "📚 Уроки психологической подготовки",
    "menu_portret": "👤 Психологический портрет",
    "menu_change_lang": "🌐 Сменить язык",
    "blocked_user": "🚫 Ваш аккаунт временно заблокирован. Обратитесь в поддержку.",
    "commands": {
        "start": "Перезапустить бота",
        "lang": "Сменить язык"
    }
}

EYSENCK_RESULTS_RU = {
    "title": "📊 **Ваши психологические показатели:**\n\n",
    "temperament_title": "🧠 **Темперамент:**",
    "lie_title": "📋 **Шкала лжи:**",
    "stability_title": "🛡️ **Нервная система:**",
    "extra_intro_title": "💬 **Экстраверсия-интроверсия:**",
    "neuro_title": "⚡ **Нейротизм:**",
    "ball": "балл",

    # Temperament tavsiflari
    "choleric": "Холерик \n(Энергичный, эмоциональный, быстрые реакции)",
    "sanguine": "Сангвиник \n(Активный, общительный, быстро адаптируется)",
    "melancholic": "Меланхолик \n(Чувствительный, вдумчивый, осторожный)",
    "phlegmatic": "Флегматик \n(Спокойный, терпеливый, устойчивый характер)",

    # Ishonchlilik darajalari
    "lie_low": "Достоверные\n(Ответы искренние и достоверные)",
    "lie_high": "Недостоверные\n(В ответах есть противоречия)",

    # Barqarorlik
    "stable": "Стабильные\n(Хорошо контролирует свои эмоции)",
    "unstable": "Нестабильные\n(Склонен к эмоциональным колебаниям)",

    # Ekstra-Intro tavsiflari
    "introvert": "Интроверт\n(Спокойный, склонен к самоанализу)",
    "extravert": "Экстраверт\n(Открытый, активный, командный )",
    "ambivert": "Амбиверт\n(Гибко выстраивает общение с окружающими)",

    # Nevrotizm darajalari
    "level_low": "Низкий\n(Спокойный и эмоционально устойчивый)",
    "level_medium": "Средний\n(Повышенная тревожность и эмоциональная чувствительность могут иногда вызывать беспокойство)",
    "level_high": "Высокий\n(Повышенная тревожность и чувствительность)"
}

MILLMAN_RESULT_RU = {
    "emotional_resilience": "❤️ Соревновательная эмоциональная устойчивость:",
    "self_regulation": "🎯 Саморегуляция:",
    "scale_motivation": "🚀 Мотивационно-энергетический компонент:",
    "scale_resistance": "🧱 Стабильность-помехоустойчивость:",
    "q17": "🎭 Характер эмоциональных реакций:",

    "emotional_resilience_desc": "Уровень эмоционального самоконтроля в стрессовой ситуации",
    "self_regulation_desc": "Уровень способности сознательно контролировать свои действия",
    "scale_motivation_desc": "Уровень сильного стремления к достижению цели",
    "scale_resistance_desc": "Уровень склонности к подавленности в трудных ситуациях"
}

Q17_RU = {
    "neytral": "Нейтрал",
    "stenik": "Стеник",
    "astenik": "Астеник"
}

SAVOLNOMA_RESULT_RU = {
    "title": {"text": "🤝 Необходимость психологической поддержки: "},
    "options": {
        True: "Есть",
        False: "Нет"
    }
}

RESULT_WARNING_RU = (
    "❓ **Данный тест необходимо интерпретировать с участием специалиста-психолога, в противном случае это "
    "может привести к неправильному пониманию результатов.**"
)
